app/controllers/orders_controller.rb

INSERT INTO "orders" ("quantity", "price", "service_id", "user_id", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["quantity", 1], ["price", 1000], ["service_id", 1], ["user_id", 1], ["total_price", 1000], ["created_at", "2017-02-13 09:11:43.498865"], ["updated_at", "2017-02-13 09:11:43.498865"]]
---
  def create
    # TODO: Create a new order for the spcified user/service.
    # Redirect to an appropriate page if save fails.

    @orders = @service.orders.create(order_params)

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT 1  [["id", 4]]
---
  def show
    @orders = Order.find(params[:id])

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 1]]
---
  def user_orders
    @orders = current_user.orders

SELECT  "services".* FROM "services" WHERE "services"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_service
      @service = Service.find(params[:service_id])