app/controllers/pages_controller.rb

SELECT  "services".* FROM "services"  ORDER BY "services"."id" DESC LIMIT 4
---
  def home
  	@services = Service.last(4).reverse