app/controllers/services_controller.rb

INSERT INTO "services" ("title", "description", "price", "requirements", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    # TODO: Save the newly created service. Redirect to an appropriate page if save fails.
    @service = current_user.services.create(service_params)

SELECT "services".* FROM "services"
---
  def all_services
    @service = Service.all